#a=[{'投放账户': '戴戴戴师兄', '广告计划名称': '《戴你玩转数据分析》_职场新人_18-24_1-6', '广告计划ID': 'AD666', '优化目标': '直播间成交', '客单价': 88, '消耗': 2245, '直播间曝光数': 5893, '直播间观看数': 2298, '商品点击数': 1654, '商品下单数': 160, '商品成交数': 14, 'GMV': 123200, '成交金额': 123200, '投放日期': '2023-01-01'}, {'投放账户': '戴戴戴师兄', '广告计划名称': '《商业分析课程》_数据分析-商业分析_22-35_1-6', '广告计划ID': 'AD888', '优化目标': '直播间成交', '客单价': 288, '消耗': 3231, '直播间曝光数': 3274, '直播间观看数': 1702, '商品点击数': 1174, '商品下单数': 102, '商品成交数': 10, 'GMV': 288000, '成交金额': 288000, '投放日期': '2023-01-01'}, {'投放账户': '戴戴戴师兄', '广告计划名称': '《数据分析工具课程》_数据分析_22-35_1-6', '广告计划ID': 'AD999', '优化目标': '直播间成交', '客单价': 188, '消耗': 3784, '直播间曝光数': 5865, '直播间观看数': 4633, '商品点击数': 2779, '商品下单数': 200, '商品成交数': 27, 'GMV': 507600, '成交金额': 507600, '投放日期': '2023-01-01'}]
import pandas as pd
import numpy as np
#b=pd.Series(a)
c=pd.Series([1,2,3,4],['a','s','d','f'])
d=pd.DataFrame(np.ones((3,5)),index=['a','b','c'])
'''c['a']=99
c[['s','d']]=44
c['s','d']=33,55
d=c
#print(b)
#print(pd.DataFrame)
b=c[['a','b']]
print(b)
#print(c['a'])'''
print(d)
print(d[:2])
